0.1.0/tutorials/incompressible/pimple/channel395/0.org/nut
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "1";
  object      nut;
}

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  bottomWall
  {
    type            zeroGradient;
  }
  topWall
  {
    type            zeroGradient;
  }
  sides1_half0
  {
    type            cyclic;
  }
  sides2_half0
  {
    type            cyclic;
  }
  inout1_half0
  {
    type            cyclic;
  }
  inout2_half0
  {
    type            cyclic;
  }
  sides2_half1
  {
    type            cyclic;
  }
  sides1_half1
  {
    type            cyclic;
  }
  inout1_half1
  {
    type            cyclic;
  }
  inout2_half1
  {
    type            cyclic;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
