0.1.0/tutorials/incompressible/pimple/channel395/constant/fvOptions
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "constant";
  object      fvOptions;
}

momentumSource
{
  type            meanVelocityForce;
  active          yes;
  meanVelocityForceCoeffs
  {
    selectionMode   all;
    fieldNames      (U);
    Ubar            (0.1335 0 0);
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
