0.1.0/tutorials/incompressible/pimple/channel395/constant/postChannelDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "constant";
  object      postChannelDict;
}

// Seed patches to start layering from
patches         ( bottomWall );
// Direction in which the layers are
component       y;
// Is the mesh symmetric? If so average(symmetric fields) or
// subtract(asymmetric) contributions from both halves
symmetric       true;

// vim: set ft=foam et sw=2 ts=2 sts=2:
