0.1.0/tutorials/incompressible/pimple/channel395/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}

solvers
{
  p
  {
    solver          GAMG;
    tolerance       0;
    relTol          0.1;
    smoother        GaussSeidel;
    nPreSweeps      0;
    nPostSweeps     2;
    cacheAgglomeration true;
    nCellsInCoarsestLevel 10;
    agglomerator    faceAreaPair;
    mergeLevels     1;
  }
  pFinal
  {
    $p;
    smoother        DICGaussSeidel;
    tolerance       1e-06;
    relTol          0;
  }
  "(U|k|nuTilda)"
  {
    solver          smoothSolver;
    smoother        symGaussSeidel;
    tolerance       1e-05;
    relTol          0.1;
  }
  "(U|k|nuTilda)Final"
  {
    $U;
    tolerance       1e-05;
    relTol          0;
  }
}
PIMPLE
{
  nOuterCorrectors 1;
  nCorrectors     2;
  nNonOrthogonalCorrectors 0;
  pRefCell        1001;
  pRefValue       0;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
